<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">

  <title><![CDATA[Category: Docker | Chun Sing Tsui]]></title>
  <link href="http://www.cstsui.com/blog/categories/docker/atom.xml" rel="self"/>
  <link href="http://www.cstsui.com/"/>
  <updated>2020-07-16T06:29:00-04:00</updated>
  <id>http://www.cstsui.com/</id>
  <author>
    <name><![CDATA[Chun Sing Tsui]]></name>
    
  </author>
  <generator uri="http://octopress.org/">Octopress</generator>

  
  <entry>
    <title type="html"><![CDATA[DataPower QuickStart (Docker)]]></title>
    <link href="http://www.cstsui.com/blog/2020/03/12/datapower-quickstart/"/>
    <updated>2020-03-12T21:44:35-04:00</updated>
    <id>http://www.cstsui.com/blog/2020/03/12/datapower-quickstart</id>
    <content type="html"><![CDATA[<p>Following the <a href="https://developer.ibm.com/datapower/docker">IBM Developer Guide</a> on the Dockerized version of DataPower is a great way to start playing around with the DataPower application gateway.</p>

<p>There are some small gotchas that the guide does not mention and they are noted here.</p>

<h3>SSH Port Number</h3>

<p>In the newer releases of DataPower in container form, the IDG process is not ran with root. Therefore using port 22 as the SSH port will fail since only root user is allowed to use ports under 1024. We have to make a small change to the target port mapping from 22 to 9022 (or another high numbered port number).</p>

<p>As seen in the <a href="https://developer.ibm.com/answers/questions/394482/ssh-service-on-new-datapower-docker-container-will/">Developer Works answer found here</a>:</p>

<pre><code>One of the changes in 7.6 is that by default, the DataPower Gateway process runs as the non-root drouter user inside the Docker container. Because of this, DataPower does not have permissions to use privileged ports.
</code></pre>

<p>So we make the simple change to 9022:</p>

<pre><code> docker run -it \
    -v $PWD/config:/drouter/config \
    -v $PWD/local:/drouter/local \
    -e DATAPOWER_ACCEPT_LICENSE=true \
    -e DATAPOWER_INTERACTIVE=true \
    -p 9090:9090 \
    -p 9022:9022 \
    -p 5554:5554 \
    -p 8000-8010:8000-8010 \
    --name idg \
    ibmcom/datapower
</code></pre>

<p>We can now enable ssh so we can log into the DataPower CLI and execute commands.</p>

<h3>Enable SSH</h3>

<p>After logging into the CLI with username and password, we can enable SSH and designate the port.</p>

<p>Since we are port-forwarding via 9022, it will be the one used for SSH.</p>

<pre><code>idg# configure
Global mode
idg(config)# ssh 0.0.0.0 9022

%   Pending

SSH service listener enabled
</code></pre>

<p>If the port number selected is still in the privilege range (i.e. &lt;1024), the confusing part in trying to bring up the SSH service via the web UI or the CLI is there aren&rsquo;t any obvious errors about why the SSH service does not come up (in the case of the Web UI) or why the service is reported as up but is not reachable (in the case of the CLI)</p>

<h3>Enable Web Admin UI</h3>

<p>Port 9090 is one of the port we are exposing in the Docker run commands, and we use this to reach the web admin UI.</p>

<pre><code>idg(config)# web-mgmt 0 9090 9090;
Web management: successfully started
</code></pre>

<p>When navigating to it in the browser via localhost, don&rsquo;t forget to specify <code>https</code></p>

<pre><code>https://localhost:9090
</code></pre>

<h3>Enabling REST Management</h3>

<p>This allows us to manage the gateway using its REST API</p>

<pre><code>idg(config)# rest-mgmt 0  5554
REST management: successfully started
</code></pre>

<p>After enabling, we can check if its enabled by curl-ing the REST endpoint</p>

<pre><code>$ curl -k -u admin:admin https://localhost:5554/mgmt/config/default/RestMgmtInterface
{

    "_links" : {

    "self" : {"href" : "/mgmt/config/default/RestMgmtInterface"}, 

    "doc" : {"href" : "/mgmt/docs/config/RestMgmtInterface"}}, 

    "RestMgmtInterface" : {"name" : "RestMgmt-Settings", 

    "_links" : {

    "self" : {"href" : "/mgmt/config/default/RestMgmtInterface/RestMgmt-Settings"}, 

    "doc" : {"href" : "/mgmt/docs/config/RestMgmtInterface"}}, 

    "mAdminState" : "enabled", 

    "LocalAddress" : "0.0.0.0", 

    "LocalPort" : 5554, 

    "ACL" : {"value": "rest-mgmt", 

    "href" : "/mgmt/config/default/AccessControlList/rest-mgmt"}, 

    "SSLConfigType" : "server"}}
</code></pre>

<h3>Saving the Configuration</h3>

<p>If you would like for the config values to persist and be picked up next time the DataPower container gets restarted, we can persist the configs to files.</p>

<pre><code>idg(config)# write memory
Overwrite previously saved configuration? Yes/No [y/n]: y
Configuration saved successfully.
</code></pre>

<h3>Reference Commands and Outputs</h3>

<pre><code>login: admin
Password: *****

Welcome to IBM DataPower Gateway console configuration. 
Copyright IBM Corporation 1999, 2020 

Version: IDG.2018.4.1.10 build 318002 on Feb 21, 2020 11:09:49 AM
Delivery type: LTS
Serial number: 0000001

idg# configure
Global mode
idg(config)# ssh 0.0.0.0 9022

%   Pending

SSH service listener enabled

idg(config)# web-mgmt 0 9090 9090;
Web management: successfully started

idg(config)# rest-mgmt 0  5554
REST management: successfully started

idg(config)# write memory
Overwrite previously saved configuration? Yes/No [y/n]: y
Configuration saved successfully.
</code></pre>
]]></content>
  </entry>
  
</feed>
